## Homework
# Exercise 1: 
Create a dataframe of at least 1000 rows about an hypothetical list of employees of your company, extract all employees in the IT department and a Salary greater than 55000.

In [3]:
#!pip install pandas==1.5.3
import pandas as pd
import numpy as np

In [4]:
np.random.seed(20)

In [5]:
employees = 1020

In [6]:
departments = ["IT", "Administration","HR"]

In [24]:
departments_data = np.random.choice(departments, size= employees)

In [10]:
names = [f"Employee{num}" for num in range(1,employees+1)]
names[1:4]

['Employee2', 'Employee3', 'Employee4']

In [11]:
age = np.random.randint(18,68, size= employees)
age[1:4]

array([44, 33, 49], dtype=int32)

In [15]:
salary = np.random.randint(32000, 90000, size=employees)
salary[-4:-1]

array([85024, 56705, 42628], dtype=int32)

creo dataframe

In [29]:
data = {
    "Employee_ID": range(1,employees+1),
    "Name":names,
    "Age": age,
    "Department" : departments_data, 
    "Salary":salary 
}
df = pd.DataFrame(data)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee_ID  1020 non-null   int64
 1   Name         1020 non-null   object
 2   Age          1020 non-null   int32
 3   Department   1020 non-null   object
 4   Salary       1020 non-null   int32
dtypes: int32(2), int64(1), object(2)
memory usage: 32.0+ KB

In [33]:
df_salary= df[(df["Department"]=="IT")&(df["Salary"]> 55000)].reset_index()
df_salary.tail()

     index  Employee_ID          Name  Age Department  Salary
205   1003         1004  Employee1004   40         IT   66272
206   1004         1005  Employee1005   29         IT   80020
207   1009         1010  Employee1010   19         IT   85320
208   1010         1011  Employee1011   36         IT   58961
209   1016         1017  Employee1017   43         IT   85024

# Exercise 2: 
Create a column to split the data in Low, Medium, High fare prices and calculate the average Age per each section. Fill the Age set to nan and calculate the average age again, how did it change? How can you fill the age so that the average does not change?

In [76]:
# Read the Titanic data
df_titanic = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [77]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [78]:
df_titanic["Fare_Category"] = pd.cut(df_titanic["Fare"], bins=[0, int(df_titanic["Fare"].max()*0.333), int( df_titanic["Fare"].max()*0.666) , df_titanic["Fare"].max()], labels=["Low", "Medium", "High"])
df_titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Category
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,Low
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,Low
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,Low
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,Low
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,Low

Calculate the everage age for each class

In [79]:
df_average_age = df_titanic.groupby("Fare_Category")["Age"].mean()
df_average_age

C:\Users\marti\AppData\Local\Temp\ipykernel_14644\3976406835.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_average_age = df_titanic.groupby("Fare_Category")["Age"].mean()

Fare_Category
Low       29.605472
Medium    30.333333
High      35.333333
Name: Age, dtype: float64

In [82]:
df_fill_age = df_titanic.copy()
df_fill_age["Age"]= df_fill_age.groupby("Fare_Category")["Age"].transform(lambda x: x.fillna(x.mean()))
df_fill_age.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PassengerId    891 non-null    int64
 1   Survived       891 non-null    int64
 2   Pclass         891 non-null    int64
 3   Name           891 non-null    object
 4   Sex            891 non-null    object
 5   Age            876 non-null    float64
 6   SibSp          891 non-null    int64
 7   Parch          891 non-null    int64
 8   Ticket         891 non-null    object
 9   Fare           891 non-null    float64
 10  Cabin          204 non-null    object
 11  Embarked       889 non-null    object
 12  Fare_Category  876 non-null    category
dtypes: category(1), float64(2), int64(5), object(5)
memory usage: 84.7+ KB

C:\Users\marti\AppData\Local\Temp\ipykernel_14644\1090628191.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_fill_age["Age"]= df_fill_age.groupby("Fare_Category")["Age"].transform(lambda x: x.fillna(x.mean()))

In [86]:
df_average_fill_age = df_fill_age.groupby("Fare_Category")["Age"].mean()
df_average_fill_age

C:\Users\marti\AppData\Local\Temp\ipykernel_14644\2613433801.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_average_fill_age = df_fill_age.groupby("Fare_Category")["Age"].mean()

Fare_Category
Low       29.605472
Medium    30.333333
High      35.333333
Name: Age, dtype: float64